In [1]:
import pandas as pd

In [2]:
data = {
    'Empleado': ['Juan', 'Ana', 'Pedro', 'Maria', 'Luis'],
    'Salario': [50000, 60000, 55000, 58000, 62000],
    'Departamento': ['Ventas', 'Marketing', 'Ventas', 'IT', 'Marketing'],
    'Años_Experiencia': [5, 7, 6, 8, 9]   
    
}

df = pd.DataFrame(data)
# This code creates a DataFrame with employee data including their names, salaries, departments, and
# years of experience. The DataFrame is then displayed.

df

  Empleado  Salario Departamento  Años_Experiencia
0     Juan    50000       Ventas                 5
1      Ana    60000    Marketing                 7
2    Pedro    55000       Ventas                 6
3    Maria    58000           IT                 8
4     Luis    62000    Marketing                 9

In [3]:
df_renombrado = df.rename(columns={'Salario': 'Salario_Anual', 'Años_Experiencia': 'Experiencia'})
print("DataFrame con columnas renombradas:\n", df_renombrado)
# This code renames the columns 'Salario' to 'Salario_Anual'

DataFrame con columnas renombradas:
   Empleado  Salario_Anual Departamento  Experiencia
0     Juan          50000       Ventas            5
1      Ana          60000    Marketing            7
2    Pedro          55000       Ventas            6
3    Maria          58000           IT            8
4     Luis          62000    Marketing            9

In [4]:
df.columns = ['Empleado', 'Salario_Anual', 'Departamento', 'Experiencia']
print("DataFrame con columnas renombradas usando asignación directa:\n", df)

DataFrame con columnas renombradas usando asignación directa:
   Empleado  Salario_Anual Departamento  Experiencia
0     Juan          50000       Ventas            5
1      Ana          60000    Marketing            7
2    Pedro          55000       Ventas            6
3    Maria          58000           IT            8
4     Luis          62000    Marketing            9

In [ ]:
#Renombrar índices
df_renombrado_indices = df.rename(index={0: 'Primero', 1: 'Segundo', 2: 'Tercero', 3: 'Cuarto', 4: 'Quinto'})
print("DataFrame con índices renombrados:\n", df_renombrado_indices)

DataFrame con índices renombrados:
         Empleado  Salario_Anual Departamento  Experiencia
Primero     Juan          50000       Ventas            5
Segundo      Ana          60000    Marketing            7
Tercero    Pedro          55000       Ventas            6
Cuarto     Maria          58000           IT            8
Quinto      Luis          62000    Marketing            9

In [6]:
#Renombrar índices al dataframe original
df.index = ['Emp1', 'Emp2', 'Emp3', 'Emp4', 'Emp5']
print("DataFrame original con índices renombrados:\n", df)

DataFrame original con índices renombrados:
      Empleado  Salario_Anual Departamento  Experiencia
Emp1     Juan          50000       Ventas            5
Emp2      Ana          60000    Marketing            7
Emp3    Pedro          55000       Ventas            6
Emp4    Maria          58000           IT            8
Emp5     Luis          62000    Marketing            9

In [ ]:
#Datafram reorganizado para cambiar el orden de las columnas se crea una nueva variable o dataframe
df_reorganizado = df.reindex(columns=['Empleado', 'Departamento', 'Experiencia', 'Salario_Anual'])
print("DataFrame reorganizado:\n", df_reorganizado)

DataFrame reorganizado:
      Empleado Departamento  Experiencia  Salario_Anual
Emp1     Juan       Ventas            5          50000
Emp2      Ana    Marketing            7          60000
Emp3    Pedro       Ventas            6          55000
Emp4    Maria           IT            8          58000
Emp5     Luis    Marketing            9          62000

In [ ]:
#Organizado colunas con una lista con el dataframe original
df = df[['Experiencia', 'Empleado', 'Salario_Anual', 'Departamento']]
df

      Experiencia Empleado  Salario_Anual Departamento
Emp1            5     Juan          50000       Ventas
Emp2            7      Ana          60000    Marketing
Emp3            6    Pedro          55000       Ventas
Emp4            8    Maria          58000           IT
Emp5            9     Luis          62000    Marketing

In [ ]:
#Ordenar filas por valores de un índice específico se crea una nueva variable o dataframe
df_reorganizado_filas = df.reindex(index=['Emp3', 'Emp1', 'Emp2', 'Emp5', 'Emp4'])
print("DataFrame con filas reorganizadas:\n", df_reorganizado_filas)

DataFrame con filas reorganizadas:
       Experiencia Empleado  Salario_Anual Departamento
Emp3            6    Pedro          55000       Ventas
Emp1            5     Juan          50000       Ventas
Emp2            7      Ana          60000    Marketing
Emp5            9     Luis          62000    Marketing
Emp4            8    Maria          58000           IT

In [12]:
df_ordenado_filas = df.sort_index()
df_ordenado_filas

      Experiencia Empleado  Salario_Anual Departamento
Emp1            5     Juan          50000       Ventas
Emp2            7      Ana          60000    Marketing
Emp3            6    Pedro          55000       Ventas
Emp4            8    Maria          58000           IT
Emp5            9     Luis          62000    Marketing